In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.DataFrame({'Salarié': ['Eric', 'Hapsa', 'Elise', 'Xin'], 'groupe': ['Technicien', 'Ingénieur', 'Ingénieur', 'Technicien']})

In [3]:
df2 = pd.DataFrame({'Salarié': ['Hapsa', 'Elise', 'Eric', 'Xin'], 'date_embauche': [2001, 1988, 2012, 2016]})

In [4]:
df3 = pd.merge(df1, df2)

In [5]:
df3

  Salarié      groupe  date_embauche
0    Eric  Technicien           2012
1   Hapsa   Ingénieur           2001
2   Elise   Ingénieur           1988
3     Xin  Technicien           2016

In [6]:
df4 = pd.DataFrame({'groupe': ['Technicien', 'Ingénieur'], 'Superviseur': ['Carlos', 'Amine']})

In [7]:
print(pd.merge(df3, df4))

  Salarié      groupe  date_embauche Superviseur
0    Eric  Technicien           2012      Carlos
1     Xin  Technicien           2016      Carlos
2   Hapsa   Ingénieur           2001       Amine
3   Elise   Ingénieur           1988       Amine

In [8]:
df5 = pd.DataFrame({'groupe': ['Technicien', 'Technicien', 'Ingénieur', 'Ingénieur', 'Ingénieur'], 'compétences': ['tableurs', 'maintenance', 'codage', 'conduite de changement',
'recherche opérationelle']})

In [9]:
print(pd.merge(df3, df5))

  Salarié      groupe  date_embauche              compétences
0    Eric  Technicien           2012                 tableurs
1    Eric  Technicien           2012              maintenance
2     Xin  Technicien           2016                 tableurs
3     Xin  Technicien           2016              maintenance
4   Hapsa   Ingénieur           2001                   codage
5   Hapsa   Ingénieur           2001   conduite de changement
6   Hapsa   Ingénieur           2001  recherche opérationelle
7   Elise   Ingénieur           1988                   codage
8   Elise   Ingénieur           1988   conduite de changement
9   Elise   Ingénieur           1988  recherche opérationelle

In [10]:
df6= pd.DataFrame({'Nom': ['Hapsa', 'Elise', 'Xin','Amine'],'salaire': [90000, 100000, 80000, 100000]})

In [11]:
print(pd.merge(df3, df6, left_on="Salarié", right_on="Nom"))

  Salarié      groupe  date_embauche    Nom  salaire
0   Hapsa   Ingénieur           2001  Hapsa    90000
1   Elise   Ingénieur           1988  Elise   100000
2     Xin  Technicien           2016    Xin    80000

In [12]:
df7 = pd.merge(df3, df6, left_on="Salarié", right_on="Nom").drop('Nom', axis=1)
df7

  Salarié      groupe  date_embauche  salaire
0   Hapsa   Ingénieur           2001    90000
1   Elise   Ingénieur           1988   100000
2     Xin  Technicien           2016    80000

In [13]:
pd.merge(df3, df6, left_on="Salarié", right_on="Nom",how='outer').drop('Nom', axis=1)

  Salarié      groupe  date_embauche   salaire
0    Eric  Technicien         2012.0       NaN
1   Hapsa   Ingénieur         2001.0   90000.0
2   Elise   Ingénieur         1988.0  100000.0
3     Xin  Technicien         2016.0   80000.0
4     NaN         NaN            NaN  100000.0

In [14]:
pd.merge(df3, df6, left_on="Salarié", right_on="Nom",how='left').drop('Nom', axis=1)

  Salarié      groupe  date_embauche   salaire
0    Eric  Technicien           2012       NaN
1   Hapsa   Ingénieur           2001   90000.0
2   Elise   Ingénieur           1988  100000.0
3     Xin  Technicien           2016   80000.0

In [15]:
pd.merge(df3, df6, left_on="Salarié", right_on="Nom",how='right').drop('Nom', axis=1)

  Salarié      groupe  date_embauche  salaire
0   Hapsa   Ingénieur         2001.0    90000
1   Elise   Ingénieur         1988.0   100000
2     Xin  Technicien         2016.0    80000
3     NaN         NaN            NaN   100000

In [16]:
df8 = pd.DataFrame({'Salarié': ['Eric', 'Hapsa', 'Elise', 'Xin'], 'Classement':[4,1,2,3]})
df9 = pd.DataFrame({'Salarié': ['Eric', 'Hapsa', 'Elise', 'Xin'], 'Classement':[4,1,3,2]})

In [17]:
pd.merge(df8, df9, on="Salarié")

  Salarié  Classement_x  Classement_y
0    Eric             4             4
1   Hapsa             1             1
2   Elise             2             3
3     Xin             3             2

In [18]:
pd.merge(df8, df9, on="Salarié", suffixes=[" Novembre", " Décembre"])

  Salarié  Classement Novembre  Classement Décembre
0    Eric                    4                    4
1   Hapsa                    1                    1
2   Elise                    2                    3
3     Xin                    3                    2